import numpy as np

if __name__ == '__main__':
    arr1 = np.arange(2, 14)
    print(arr1)
    # 第二个位置的数据
    print("=================第二个位置的数据==================")
    print(arr1[2])
    print("=================第一到第四个位置的数据==================")
    print(arr1[1:4])
    print("=================第二到倒数第一个位置的数据==================")
    print(arr1[2:-1])
    print("=================前五个数据==================")
    print(arr1[:5])
    print("=================最后两个数据==================")
    print(arr1[-2:])
    print("=================将arr1 形状改变 3*4==================")
    arr2 = arr1.reshape(3, 4)
    print(arr2)
    print("=================打印第二行==================")
    print(arr2[1])
    print("=================打印第二行 第二列元素==================")
    print(arr2[1][1])
    print("=================打印第三列元素==================")
    print(arr2[:, 2])
    print("=================行迭代==================")
    for i in arr2:
        print(i)
    print("=================迭代列==================")
    for i in arr2.T:
        print(i)

    print("=================一个一个元素迭代==================")
    for i in arr2.flat:
        print(i)




